Repository: anhpha/reports
Catalog: src/CPSE/API/UserBundle/Resources/translations/apiuser.*.xlf
Languages: vi

source: Profile
vi: Thông tin người dùng

source: profile.show.username
vi: Tên đăng nhập

source: profile.show.email
vi: Email

source: profile.show.fullname
vi: Tên đầy đủ

source: APIUser list
vi: Danh sách người dùng

source: Enabled
vi: Cho phép đăng nhập

source: Lastlogin
vi: Lần đăng nhập cuối cùng

source: Roles
vi: Chức danh

source: Fullname
vi: Tên đầy đủ

source: Locked
vi: Khóa

source: Profile
vi: Cá nhân

source: Username
vi: Tên đăng nhập

source: APIUser edit
vi: Cập nhật thông tin người dùng

source: APIUser edit
vi: Cập nhật thông tin người dùng

source: Editor
vi: Quản lý tài liệu

source: Deputy Manager
vi: Phó trưởng phòng

source: Manager
vi: Trưởng phòng

source: Deputy Director
vi: Phó giám đốc

source: Director
vi: Giám đốc

source: APIUser creation
vi: Thêm mới nhân viên

source: Password
vi: Mật khẩu

source: Retype password
vi: Xác nhận mật khẩu

source: Modify profile
vi: Thay đổi thông tin cá nhân

source: profile.edit.submit
vi: Cập nhật

source: Profile
vi: Thông tin cá nhân

source: Change password
vi: Thay đổi mật khẩu
