Repository: anhpha/reports
Catalog: src/CPSE/API/ProjectBundle/Resources/translations/documentcategory.*.xlf
Languages: vi

source: DocumentCategory list
vi: Danh sách loại tài liệu

source: Parent
vi: Thuộc loại

source: Name
vi: Tên

source: Description
vi: Mô tả

source: Created_on
vi: Tạo ngày

source: Created_by
vi: Tạo bởi

source: Updated_on
vi: Cập nhật lần cuối

source: Updated_by
vi: Cập nhật bởi

source: DocumentCategory edit
vi: Cập nhật thông tin

source: DocumentCategory creation
vi: Thêm mới loại tài liệu

source: DocumentCategory
vi: Thông tin loại tài liệu

source: Are your sure to delelte
vi: Nếu xóa thư mục này, tất cả các tài liệu con sẽ bị xóa. Bạn có chắc chắn muốn xóa loại tài liệu
