Repository: anhpha/reports
Catalog: src/CPSE/API/ProjectBundle/Resources/translations/document.*.xlf
Languages: vi

source: Document list
vi: Danh sách tài liệu

source: Category_id
vi: Thuộc loại

source: Name
vi: Tên

source: Description
vi: Mô tả

source: Document edit
vi: Cập nhật thông tin tài liệu

source: Document creation
vi: Thêm mới tài liệu

source: Document
vi: Thông tin tài liệu

source: Path
vi: Link

source: Status
vi: Trạng thái

source: File
vi: Upload tập tin

source: Search results
vi: Kết quả tìm cho từ khóa

source: belong to
vi: thuộc loại

source: Unable to find this document
vi: Tài liệu không tồn tại

source: This document is using by an other
vi: Tài liệu đang được sử dụng

source: Document category creation
vi: Thêm loại tài liệu mới

source: New category
vi: Thêm loại tài liệu mới

source: Document category list
vi: Danh sách tất cả tài liệu và loại tài liệu

source: Are your sure to delelte
vi: Bạn có chắc chắn muốn xóa tài liệu
