Repository: anhpha/reports
Catalog: src/CPSE/API/ProjectBundle/Resources/translations/projectcategory.*.xlf
Languages: vi

source: Name
vi: Tên

source: Description
vi: Mô tả

source: Edit
vi: Chá»‰nh sá»­a

source: Delete
vi: XÃ³a

source: New
vi: ThÃªm má»›i

source: Project category list
vi: Danh sách loại dự án

source: Add new project category
vi: Thêm mới loại dự án

source: Parent
vi: Thuộc loại

source: Documentcategory
vi: Báo cáo sẽ lưu vào loại

source: ProjectCategory creation
vi: Thêm mới loại dự án

source: ProjectCategory list
vi: Danh sách loại dự án

source: ProjectCategory
vi: Thông tin loại dự án

source: ProjectCategory edit
vi: Chỉnh sửa thông tin loại dự án

source: Are your sure to delelte
vi: Bạn có chắn chắn muốn xóa loại dự án

source: This have child project!
vi: Không thể xóa loại dự án này. Hiện đang có dự án thuộc loại này trong hệ thống!

source: Please choose folder
vi: Vui lòng chọn thư mục chứa báo cáo
