Repository: anhpha/reports
Catalog: src/CPSE/API/ProjectBundle/Resources/translations/project.*.xlf
Languages: vi

source: Name
vi: Tên

source: Description
vi: Mô tả

source: Project list
vi: Danh sách dự án

source: Add new project
vi: Thêm dự án mới

source: Parent
vi: Thuộc loại

source: Parent
vi: Thuộc loại

source: Start
vi: Ngày bắt đầu

source: End
vi: Ngày kết thúc

source: Category
vi: Thuộc loại

source: Pm
vi: Trưởng dự án

source: Status
vi: Trạng thái

source: Project_code
vi: Mã dự án

source: Members
vi: Danh sách thành viên

source: References
vi: Danh sách tài liệu liên quan

source: Product
vi: Báo cáo cuối

source: Project edit
vi: Chỉnh sửa thông tin dự án

source: Project
vi: Thông tin dự án

source: Project creation
vi: Thêm dự án mới

source: did not match any item
vi: Không tồn tại

source: Add more member
vi: Thêm thành viên mới

source: Member has been added!
vi: Thành viên này đã tồn tại!

source: If you delete this project, all related information will be lost. Are you sure to delete project:
vi: Nếu bạn xóa dự án này, tất cả các thông tin và tài liệu liên quan sẽ bị xóa. Bạn có thật sự muốn xóa dự án:

source: Updated_on
vi: Ngày tạo

source: Project infor
vi: Thông tin chung

source: Project tasks
vi: Công việc

source: Project document
vi: Tài liệu tham khảo

source: Project products
vi: Danh sách sản phẩm

source: Updated_by
vi: Người cập nhật
