Repository: anhpha/reports
Catalog: src/CPSE/API/ProjectBundle/Resources/translations/task.*.xlf
Languages: vi

source: task_created
vi: Chưa phân công

source: task_assigned
vi: Đã phân công

source: task_pending
vi: Chờ xoát xét

source: task_finished
vi: Hoàn thành

source: Approved
vi: Đồng ý hoàn thành

source: Reject
vi: Không đồng ý hoàn thành

source: Content
vi: Nội dung ghi chú (lý do, diễn giải...)

source: Products
vi: Danh sách sản phẩm (báo cáo)

source: Add doc
vi: Thêm báo cáo

source: Name
vi: Tên công việc

source: Status
vi: Trạng thái

source: Task edit
vi: Thay đổi thông tin công việc

source: Task infor
vi: Thông tin công việc

source: Desription
vi: Mô tả

source: Related_docs
vi: Tài liệu tham khảo

source: Last submit
vi: Nội dung thay đổi gần nhất

source: Assigned_to
vi: Người thực hiện

source: Task reject
vi: Phản hồi công việc cần chỉnh sửa

source: Task approval
vi: Duyệt hoàn thành công việc

source: Task list
vi: Danh sách công việc

source: Progress
vi: Tiến độ

source: Deadline
vi: Hạn hoàn thành

source: Updatedat
vi: Cập nhật lần cuối

source: Task creation
vi: Tạo công việc mới

source: From
vi: Bắt đầu

source: To
vi: Hạn hoàn thành

source: Attached file
vi: Tập tin đính kèm

source: Note content
vi: Nội dung ghi chú

source: did not match any item
vi: Không tồn tại
